       
       01  IN-CUSTOMER-RECORD.
           05 IN-CUSTOMER-ID         PIC 9(5).
           05 IN-ACCOUNT-NUM         PIC 9(10).
           05 IN-ACCOUNT-NAMES       PIC X(50).
           05 IN-ACCOUNT-TYPE        PIC X(6).
           05 IN-ACCOUNT-BALANCE     PIC S9(9)V99.
