       
       01 FRUIT-TABLE.
        05 FRUITS OCCURS 3 TIMES INDEXED BY IDX.
         10 CATEGORY         PIC X(20).
         10 FRUIT-NAME       PIC X(20).

       01 CATEGORIZE PIC X(60) VALUE "TROPICAL: CITRUS: BERRIES: ". 
       01 NAMING     PIC X(30) VALUE "MANGO ORANGE STRAWBERRY ". 
