      
       01  CUS-RECORD.
           05 CUS-ACCOUNT-NUM         PIC 9(10).
           05 CUS-ACCOUNT-NAMES       PIC X(50).
           05 CUS-ACCOUNT-TYPE        PIC X(6).
           05 CUS-ACCOUNT-BALANCE     PIC S9(9)V99.
           