
       01 UNFORM-DATE    PIC 9(8) VALUE 0.
       01 INPUT-DATE.
        05 YEAR-IN       PIC 9(4).
        05 MONTH-IN      PIC 99.
        05 DAY-IN        PIC 99.
       01 TOTALRETURN1    PIC 9(9) VALUE 0.
       01 TOTALRETURN2    PIC 9(9) VALUE 0.
       