      *Customer Databook
       01 CUSTOMER-RECORD. 
        05 ACCOUNT-NUM         PIC 9(10).
        05 ACCOUNT-NAMES       PIC X(50).
        05 ACCOUNT-TYPE        PIC X(6).
        05 ACCOUNT-BALANCE     PIC S9(9)V99.
           
           